title: Detect process creation activity of the DLRAT remote trojan horse used by Andariel, a subgroup of APT-Q-1 Lazarus
id: d21883f8-245f-480e-bd26-2b4f05bd9fa3
status: experimental
description: By calculating the hash value of the function names in the import function table of a binary file, known as IMPHASH, we can detect the DLRAT remote Trojan horse.
references:
    - https://blog.talosintelligence.com/lazarus_new_rats_dlang_and_telegram/
    - https://www.freebuf.com/articles/paper/386683.html
author: Hu@Sha
date: 2025-02-27
modified: 2024-02-27
tags:
    - attack.initial_access
    - attack.t1133
logsource:
    product: windows
    service: sysmon
    category: process_create
detection:
    selection:
        EventID: 1
        Hashes: '*IMPHASH=C4A0213BB099203C783857A5E2FE3EDC*'
    condition: selection
falsepositives:
    - Unlikely
level: critical
